Fix tables
